[
    {
      "title": "Réaliser",
      "bloc": "realiser",
      "projectsData": [
        {
          "id": "1-1",
          "title": "Backpack Hero",
          "date": "2022 - 2023",
          "videoSource": "Assets/img/backpack-hero/backpack-hero-presentation.mp4",
          "githubLink": "https://github.com/InkyYuu/Backpack-Hero",
          "projectLogo": "Assets/img/backpack-hero/backpack-hero-icone.ico",
          "tags": ["Java"],
          "explanation": "🎒🐭 Jeu roguelike ! Partez à l'aventure avec votre sac à dos pour parcourir le donjon en abattant les monstres avec vos différents trésors !",
          "moreExplanation": [
            ["AC11.1 - Implémenter des conceptions simples", "Le projet a implémenté des conceptions simples en développant des fonctionnalités basiques du jeu en Java, en se concentrant sur les exigences de base et en évitant la complexité inutile."],
            ["AC11.2 - Elaborer des conceptions simples", "L'élaboration des conceptions simples était au cœur du projet, en créant des structures et des mécanismes de jeu simples mais efficaces, en se concentrant sur la facilité de compréhension et de maintenance du code."],
            ["AC11.3 - Faire des essais et évaluer leurs résultats en regard des spécifications", "Des essais ont été réalisés sur les fonctionnalités développées pour évaluer leur conformité aux spécifications du jeu. Les résultats ont été examinés pour s'assurer que le jeu répondait aux attentes et aux besoins initiaux."],
            ["AC11.4 - Développer des interfaces utilisateurs", "Nous avons développé des interfaces utilisateur pour permettre aux joueurs d'interagir avec le jeu de manière conviviale. Les interfaces ont été conçues de manière simple et intuitive pour offrir une expérience utilisateur agréable et facile à utiliser."]
          ]
        },
        {
          "id": "1-2",
          "title": "PimpsMyPaids",
          "date": "2023 - 2024",
          "videoSource": "Assets/img/pmp/pmp-presentation.mp4",
          "githubLink": "https://github.com/FC-Rats/PimpMyPaids",
          "projectLogo": "Assets/img/pmp/pmp-icone.ico",
          "tags": ["Web", "PHP", "SQL"],
          "explanation": "💳🏦 PimpMyPaids est un portail Web spécialisé pour permettre aux clients, qu'ils soient des entreprises ou des commerçants, de consulter leurs comptes et de suivre leurs transactions financières quotidiennes.",
          "moreExplanation": [
            ["AC21.1 - Elaborer et implémenter les spécifications fonctionnelles et non fonctionnelles à partir des exigences","Les spécifications fonctionnelles ont été élaborées en collaboration avec les parties prenantes, détaillant la consultation de comptes et le suivi des transactions. Les spécifications non fonctionnelles, telles que la sécurité et les performances, ont également été prises en compte."],
            ["AC21.2 Appliquer des principes d'accessibilité et d'ergonomie","L'interface utilisateur a été conçue pour être conviviale et accessible, répondant aux normes d'ergonomie et d'accessibilité Web pour garantir une expérience utilisateur optimale pour tous."],
            ["AC21.3 - Adopter des bonnes pratiques de conception et de programmation","Des bonnes pratiques de conception et de programmation ont été suivies tout au long du projet, assurant la maintenabilité du code et l'utilisation de frameworks établis pour une efficacité accrue."],
            ["AC21.4 - Vérifier et valider la qualité de l'application par les tests","La qualité de l'application a été vérifiée à l'aide de tests unitaires, d'intégration et d'acceptation, garantissant un fonctionnement fiable avant le déploiement et assurant ainsi une expérience utilisateur fluide."]
          ]
        }
      ]
    },
    {
      "title": "Optimiser",
      "bloc": "optimiser",
      "projectsData": [
        {
          "id": "2-1",
          "title": "Script Graphes",
          "date": "2022 - 2023",
          "videoSource": "Assets/img/graphes/graphes-presentation.mp4",
          "githubLink": "https://github.com/InkyYuu/Graphes",
          "projectLogo": "Assets/img/graphes/graphes-icone.ico",
          "tags": ["Python"],
          "explanation": "💻🔍 Exploration algorithmique d'un programme avec les graphes : Implémentation des différents algorithmes de graphes en python.",
          "moreExplanation": [
            ["AC12.1 - Analyser un problème avec méthode (découpage en éléments algorithmiques simples, structure de données...)", "Nous avons analysé les différents problèmes liés aux graphes et avons utilisé une approche méthodique pour les résoudre. Nous avons découpé chaque problème en éléments algorithmiques simples et avons utilisé des structures de données efficaces pour optimiser les opérations sur les graphes."],
            ["AC12.2 - Comparer des algorithmes pour des problèmes classiques (tris simples, recherche...)", "Nous avons comparé différents algorithmes pour résoudre des problèmes classiques liés aux graphes, tels que la recherche de chemin le plus court ou la détermination des composantes fortement connexes. En évaluant les performances et les complexités de ces algorithmes, nous avons choisi les meilleures solutions pour optimiser les opérations sur les graphes."],
            ["AC12.3 - Formaliser et mettre en œuvre des outils mathématiques pour l'informatique", "Pour résoudre les problèmes complexes liés aux graphes, nous avons formalisé et mis en œuvre des outils mathématiques spécifiques, tels que les algorithmes de recherche de chemin le plus court ou les algorithmes de parcours de graphe. En utilisant ces outils, nous avons pu optimiser les opérations sur les graphes et résoudre efficacement les problèmes rencontrés."]
          ]
        },
        {
          "id": "2-2",
          "title": "Links Awordkening - Backend",
          "date": "2023 - 2024",
          "videoSource": "Assets/img/default/in-development.mp4",
          "githubLink": "https://github.com/FC-Rats/Links-Awordkening",
          "projectLogo": "Assets/img/la/la-icone.ico",
          "tags": ["PHP", "Java", "C"],
          "explanation": "🌿💬 \"Links Awordkening : Where Words Unite !\" est un jeu en ligne dans lequel vous devez défier votre esprit avec des chaînes de mots et explorez un monde de mots similaires pour relever le défi ultime du langage !",
          "moreExplanation": [
            ["AC22.1 - Choisir des structures de données complexes adaptées au problème", "Nous avons choisi des structures de données adaptées à chaque module. En Java, nous avons utilisé des arbres pour représenter les chaînes de mots. En C, nous avons conçu une structure de données plus complexe pour optimiser la recherche dans le dictionnaire. En PHP, nous avons sélectionné des structures de données efficaces pour le stockage des données du jeu et pour les requêtes de manière sécurisée."],
            ["AC22.2 - Utiliser des techniques algorithmiques adaptées pour des problèmes complexes", "Le module Java du projet 'Links Awordkening' utilise des algorithmes complexes pour manipuler les arbres de mots et résoudre les défis linguistiques. Le module C met en œuvre des techniques algorithmiques avancées pour optimiser les recherches dans le dictionnaire. En utilisant des algorithmes adaptés à chaque module, nous avons réussi à relever les défis techniques du projet."],
            ["AC22.3 - Comprendre les enjeux et moyens de sécurisation des données et du code", "Le module PHP du projet se concentre sur la sécurisation des données et du code. Nous avons pris des mesures pour protéger les données des utilisateurs et optimiser la sécurité des requêtes. En comprenant les enjeux de sécurité, nous avons mis en place des mesures appropriées pour garantir l'intégrité et la confidentialité des données du jeu."],
            ["AC22.4 - Evaluer l'impact environnemental et sociétal des solutions proposées", "Nous avons évalué l'impact environnemental et sociétal de notre solution en veillant à optimiser les performances et à minimiser la consommation de ressources. En concevant des structures de données efficaces et en utilisant des algorithmes optimisés, nous avons réduit l'empreinte environnementale de notre projet tout en offrant une expérience de jeu enrichissante pour les utilisateurs."]
          ]
        }
      ]
    },
    {
      "title": "Administrer",
      "bloc": "admnistrer",
      "projectsData": [
        {
          "id": "3-1",
          "title": "Links Awordkening - Serveurs",
          "date": "2023 - 2024",
          "videoSource": "Assets/img/default/in-development.mp4",
          "githubLink": "https://github.com/FC-Rats/Links-Awordkening",
          "projectLogo": "Assets/img/la/la-icone.ico",
          "tags": ["Serveur"],
          "explanation": "🌿💬 \"Links Awordkening : Where Words Unite !\" est un jeu en ligne dans lequel vous devez défier votre esprit avec des chaînes de mots et explorez un monde de mots similaires pour relever le défi ultime du langage !",
          "moreExplanation": [
            ["AC23.1 - Concevoir et développer des applications communicantes", "Nous avons conçu et développé des applications communicantes, notamment le jeu en ligne lui-même ainsi que le serveur backend qui gère les requêtes des utilisateurs et fournit les services nécessaires pour le jeu. Cela permet une interaction fluide entre les joueurs et le serveur, créant ainsi une expérience de jeu immersive."],
            ["AC23.2 - Utiliser des serveurs et des services réseaux virtualisés", "Nous avons mis en place nos propres serveurs pour le projet 'Links Awordkening', en utilisant des instances virtualisées pour chaque langage et service nécessaire. Cela nous a permis de personnaliser et de sécuriser au maximum le site, tout en ayant un contrôle total sur les services et les données du système."],
            ["AC23.3 - Sécuriser les services et données d'un système", "La sécurité des services et des données est une priorité dans le projet 'Links Awordkening'. En créant notre propre serveur et en utilisant des instances virtualisées, nous avons pu mettre en place des mesures de sécurité robustes pour protéger les services et les données du système contre les attaques potentielles. Des techniques telles que l'authentification, le chiffrement et la gestion des autorisations ont été utilisées pour assurer la sécurité globale du système."]
          ]
        }
      ]
    },
    {
      "title": "Gérer",
      "bloc": "gerer",
      "projectsData": [
        {
          "id": "4-1",
          "title": "Links Awordkening - Base de données",
          "date": "2023 - 2024",
          "videoSource": "Assets/img/default/in-development.mp4",
          "githubLink": "https://github.com/FC-Rats/Links-Awordkening",
          "projectLogo": "Assets/img/la/la-icone.ico",
          "tags": ["Web", "PHP", "SQL"],
          "explanation": "🌿💬 \"Links Awordkening : Where Words Unite !\" est un jeu en ligne dans lequel vous devez défier votre esprit avec des chaînes de mots et explorez un monde de mots similaires pour relever le défi ultime du langage !",
          "moreExplanation": [
            ["AC24.1 - Optimiser les modèles de données de l'entreprise", "Nous avons optimisé les modèles de données de l'entreprise en concevant une base de données pour stocker les données des utilisateurs, y compris les données de partie et les données personnelles. En respectant les exigences de la loi RGPD, nous avons organisé les données de manière efficace pour garantir une utilisation optimale des ressources et une gestion simplifiée des données."],
            ["AC24.2 - Assurer la sécurité des données (intégrité et confidentialité)", "La sécurité des données est une priorité dans le projet 'Links Awordkening'. Nous avons mis en place des mesures pour assurer l'intégrité et la confidentialité des données des utilisateurs, en utilisant des techniques de cryptage pour protéger les informations sensibles telles que les mots de passe et en limitant l'accès aux données personnelles uniquement aux utilisateurs autorisés."],
            ["AC24.3 - Organiser la restitution de données à travers la programmation et la visualisation", "À l'aide de PHP, HTML, CSS et JavaScript, nous avons organisé la restitution des données dans le projet 'Links Awordkening'. Les données sont récupérées de la base de données de manière sécurisée et affichées aux utilisateurs de manière conviviale à travers une interface utilisateur interactive. Cela permet aux utilisateurs de visualiser et de modifier leurs données personnelles en toute sécurité, tout en garantissant une expérience utilisateur optimale."],
            ["AC24.4 - Manipuler des données hétérogènes", "Le projet implique la manipulation de données hétérogènes, notamment les données de partie et les données personnelles des utilisateurs. En utilisant PHP pour récupérer et manipuler ces données, nous avons assuré une intégration transparente entre les différentes sources de données, garantissant ainsi une expérience utilisateur cohérente et fluide."]
          ]
        }
      ]
    },
    {
      "title": "Conduire",
      "bloc": "conduire",
      "projectsData": [
        {
          "id": "5-1",
          "title": "PimpsMyPaids",
          "date": "2023 - 2024",
          "videoSource": "Assets/img/pmp/pmp-presentation.mp4",
          "githubLink": "https://github.com/FC-Rats/PimpMyPaids",
          "projectLogo": "Assets/img/pmp/pmp-icone.ico",
          "tags": ["Figma", "Jira"],
          "explanation": "💳🏦 PimpMyPaids est un portail Web spécialisé pour permettre aux clients, qu'ils soient des entreprises ou des commerçants, de consulter leurs comptes et de suivre leurs transactions financières quotidiennes.",
          "moreExplanation": [
            ["AC25.1 - Identifier les processus présents dans une organisation en vue d'améliorer les systèmes d'information", "Nous avons analysé les processus existants des entreprises et des commerçants pour concevoir PimpMyPaids, visant à améliorer leur gestion financière quotidienne grâce à des systèmes d'information efficaces."],
            ["AC25.2 - Formaliser les besoins du client et de l'utilisateur", "En travaillant en étroite collaboration avec les parties prenantes, nous avons formalisé les besoins des clients et des utilisateurs, ce qui a servi de base pour le développement du portail Web et la définition des fonctionnalités clés."],
            ["AC25.3 - Identifier les critères de faisabilité d'un projet informatique", "Nous avons évalué les critères de faisabilité technique, financière et opérationnelle de PimpMyPaids pour garantir sa viabilité et sa réussite, en prenant en compte les contraintes et les ressources disponibles."],
            ["AC25.4 - Définir et mettre en œuvre une démarche de suivi de projet", "Nous avons mis en place une démarche de suivi de projet rigoureuse, basée sur des méthodes agiles, afin de garantir une gestion efficace du projet, de maintenir la transparence et d'assurer la livraison en temps et en heure des fonctionnalités attendues."]
          ]
        }
      ]
    },
    {
      "title": "Collobarer",
      "bloc": "collaborer",
      "projectsData": [
        {
          "id": "6-1",
          "title": "Script Comptabilité",
          "date": "2022 - 2023",
          "videoSource": "Assets/img/default/busy-and-work.mp4",
          "githubLink": "https://github.com/InkyYuu/Comptabilite",
          "projectLogo": "Assets/img/sheet-compta/comptabilite-icone.ico",
          "tags": ["Python"],
          "explanation": "📈🧮 Programmes python pour calculer le taux linéaire, le taux dégressif et faire la balance. Le code est à peu près formaté pour un affichage propre sur calculatrice. Projet à initiative personnelle en duo avec Helena Chevalier.",
          "moreExplanation": [
            ["AC16.1 - Appréhender l'écosystème numérique", "Le projet nous a permis de mieux comprendre l'écosystème numérique en mettant en pratique des concepts de programmation dans un domaine spécifique, celui de la finance."],
            ["AC16.2 - Découvrir les aptitudes requises selon les différents secteurs informatiques", "En travaillant sur ce projet personnel, nous avons découvert les aptitudes nécessaires dans le domaine financier, notamment la compréhension des concepts de taux linéaire et dégressif, ainsi que la capacité à développer des outils informatiques pour faciliter les calculs."],
            ["AC16.3 - Identifier les statuts, les fonctions et les rôles de chaque membre d'une équipe pluridisciplinaire", "En collaborant en duo avec Helena Chevalier, nous avons identifié les statuts, les fonctions et les rôles de chaque membre de notre équipe. Nous avons partagé les responsabilités et travaillé de manière complémentaire pour mener à bien le projet, en mettant en valeur nos compétences respectives."],
            ["AC16.4 - Acquérir les compétences interpersonnelles pour travailler en équipe", "Ce projet nous également a permis d'acquérir des compétences interpersonnelles essentielles pour travailler efficacement en équipe. Nous avons développé notre capacité à communiquer, à collaborer et à résoudre des problèmes ensemble, ce qui a renforcé notre collaboration et notre productivité."]
          ]
        },
        {
          "id": "6-2",
          "title": "PimpsMyPaids",
          "date": "2023 - 2024",
          "videoSource": "Assets/img/pmp/pmp-presentation.mp4",
          "githubLink": "https://github.com/FC-Rats/PimpMyPaids",
          "projectLogo": "Assets/img/pmp/pmp-icone.ico",
          "tags": ["Github", "Jira"],
          "explanation": "💳🏦 PimpMyPaids est un portail Web spécialisé pour permettre aux clients, qu'ils soient des entreprises ou des commerçants, de consulter leurs comptes et de suivre leurs transactions financières quotidiennes.",
          "moreExplanation": [
            ["AC26.1 - Comprendre la diversité, la structure et la dimension de l'informatique dans une organisation (ESN, DSI, ...)", "PimpMyPaids a été développé en tenant compte des besoins spécifiques des entreprises et des commerçants pour la gestion de leurs transactions financières, assurant sa pertinence dans le contexte professionnel."],
            ["AC26.2 - Appliquer une démarche pour intégrer une équipe informatique au sein d'une organisation", "Nous avons mis en place un processus de suivi d'équipe basé sur une méthodologie agile, favorisant une collaboration fluide et une gestion efficace du product backlog."],
            ["AC26.3 - Evaluer l'impact économique et social d'une solution informatique", "Nous avons évalué l'impact économique et social de PimpMyPaids en considérant sa capacité à optimiser la gestion financière des entreprises et des commerçants, ainsi que son potentiel à améliorer la productivité et la rentabilité dans différents secteurs d'activité."]
          ]
        }
      ]
    }
  ]
  